grevaillot/svd_tools/headers/STM32L0x2/rcc.h
#pragma once 

/* --- RCC: Reset and clock control --------------------------------- */

/** @defgroup rcc_registers Reset and clock control Register
@{*/

/** RCC_CR Clock control register **/
#define RCC_CR			MMIO32(RCC_BASE + 0x00)
/** RCC_ICSCR Internal clock sources calibration register **/
#define RCC_ICSCR			MMIO32(RCC_BASE + 0x04)
/** RCC_CRRCR Clock recovery RC register **/
#define RCC_CRRCR			MMIO32(RCC_BASE + 0x08)
/** RCC_CFGR Clock configuration register **/
#define RCC_CFGR			MMIO32(RCC_BASE + 0x0c)
/** RCC_CIER Clock interrupt enable register **/
#define RCC_CIER			MMIO32(RCC_BASE + 0x10)
/** RCC_CIFR Clock interrupt flag register **/
#define RCC_CIFR			MMIO32(RCC_BASE + 0x14)
/** RCC_CICR Clock interrupt clear register **/
#define RCC_CICR			MMIO32(RCC_BASE + 0x18)
/** RCC_IOPRSTR GPIO reset register **/
#define RCC_IOPRSTR			MMIO32(RCC_BASE + 0x1c)
/** RCC_AHBRSTR AHB peripheral reset register **/
#define RCC_AHBRSTR			MMIO32(RCC_BASE + 0x20)
/** RCC_APB2RSTR APB2 peripheral reset register **/
#define RCC_APB2RSTR			MMIO32(RCC_BASE + 0x24)
/** RCC_APB1RSTR APB1 peripheral reset register **/
#define RCC_APB1RSTR			MMIO32(RCC_BASE + 0x28)
/** RCC_IOPENR GPIO clock enable register **/
#define RCC_IOPENR			MMIO32(RCC_BASE + 0x2c)
/** RCC_AHBENR AHB peripheral clock enable register **/
#define RCC_AHBENR			MMIO32(RCC_BASE + 0x30)
/** RCC_APB2ENR APB2 peripheral clock enable register **/
#define RCC_APB2ENR			MMIO32(RCC_BASE + 0x34)
/** RCC_APB1ENR APB1 peripheral clock enable register **/
#define RCC_APB1ENR			MMIO32(RCC_BASE + 0x38)
/** RCC_IOPSMEN GPIO clock enable in sleep mode register **/
#define RCC_IOPSMEN			MMIO32(RCC_BASE + 0x3c)
/** RCC_AHBSMENR AHB peripheral clock enable in sleep mode register **/
#define RCC_AHBSMENR			MMIO32(RCC_BASE + 0x40)
/** RCC_APB2SMENR APB2 peripheral clock enable in sleep mode register **/
#define RCC_APB2SMENR			MMIO32(RCC_BASE + 0x44)
/** RCC_APB1SMENR APB1 peripheral clock enable in sleep mode register **/
#define RCC_APB1SMENR			MMIO32(RCC_BASE + 0x48)
/** RCC_CCIPR Clock configuration register **/
#define RCC_CCIPR			MMIO32(RCC_BASE + 0x4c)
/** RCC_CSR Control and status register **/
#define RCC_CSR			MMIO32(RCC_BASE + 0x50)

/**@}*/


/** @defgroup rcc_cr CR Clock control register
@{*/

/** RCC_CR_PLLRDY PLL clock ready flag **/
#define RCC_CR_PLLRDY		(1 << 25)
/** RCC_CR_PLLON PLL enable bit **/
#define RCC_CR_PLLON		(1 << 24)

#define RCC_CR_RTCPRE_SHIFT		20
#define RCC_CR_RTCPRE_MASK		0x03
/** @defgroup rcc_cr_rtcpre RTCPRE TC/LCD prescaler
@{*/
/**@}*/

/** RCC_CR_CSSLSEON Clock security system on HSE enable bit **/
#define RCC_CR_CSSLSEON		(1 << 19)
/** RCC_CR_HSEBYP HSE clock bypass bit **/
#define RCC_CR_HSEBYP		(1 << 18)
/** RCC_CR_HSERDY HSE clock ready flag **/
#define RCC_CR_HSERDY		(1 << 17)
/** RCC_CR_HSEON HSE clock enable bit **/
#define RCC_CR_HSEON		(1 << 16)
/** RCC_CR_MSIRDY MSI clock ready flag **/
#define RCC_CR_MSIRDY		(1 << 9)
/** RCC_CR_MSION MSI clock enable bit **/
#define RCC_CR_MSION		(1 << 8)
/** RCC_CR_HSI16OUTEN 16 MHz high-speed internal clock output enable **/
#define RCC_CR_HSI16OUTEN		(1 << 5)
/** RCC_CR_HSI16DIVF HSI16DIVF **/
#define RCC_CR_HSI16DIVF		(1 << 4)
/** RCC_CR_HSI16DIVEN HSI16DIVEN **/
#define RCC_CR_HSI16DIVEN		(1 << 3)
/** RCC_CR_HSI16RDYF Internal high-speed clock ready flag **/
#define RCC_CR_HSI16RDYF		(1 << 2)
/** RCC_CR_HSI16KERON High-speed internal clock enable bit for some IP kernels **/
#define RCC_CR_HSI16KERON		(1 << 1)
/** RCC_CR_HSI16ON 16 MHz high-speed internal clock enable **/
#define RCC_CR_HSI16ON		(1 << 0)

/**@}*/

/** @defgroup rcc_icscr ICSCR Internal clock sources calibration register
@{*/


#define RCC_ICSCR_MSITRIM_SHIFT		24
#define RCC_ICSCR_MSITRIM_MASK		0xff
/** @defgroup rcc_icscr_msitrim MSITRIM MSI clock trimming
@{*/
/**@}*/


#define RCC_ICSCR_MSICAL_SHIFT		16
#define RCC_ICSCR_MSICAL_MASK		0xff
/** @defgroup rcc_icscr_msical MSICAL MSI clock calibration
@{*/
/**@}*/


#define RCC_ICSCR_MSIRANGE_SHIFT		13
#define RCC_ICSCR_MSIRANGE_MASK		0x07
/** @defgroup rcc_icscr_msirange MSIRANGE MSI clock ranges
@{*/
/**@}*/


#define RCC_ICSCR_HSI16TRIM_SHIFT		8
#define RCC_ICSCR_HSI16TRIM_MASK		0x1f
/** @defgroup rcc_icscr_hsi16trim HSI16TRIM High speed internal clock trimming
@{*/
/**@}*/


#define RCC_ICSCR_HSI16CAL_SHIFT		0
#define RCC_ICSCR_HSI16CAL_MASK		0xff
/** @defgroup rcc_icscr_hsi16cal HSI16CAL nternal high speed clock calibration
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_crrcr CRRCR Clock recovery RC register
@{*/


#define RCC_CRRCR_HSI48CAL_SHIFT		8
#define RCC_CRRCR_HSI48CAL_MASK		0xff
/** @defgroup rcc_crrcr_hsi48cal HSI48CAL 48 MHz HSI clock calibration
@{*/
/**@}*/

/** RCC_CRRCR_HSI48DIV6EN 48 MHz HSI clock divided by 6 output enable **/
#define RCC_CRRCR_HSI48DIV6EN		(1 << 2)
/** RCC_CRRCR_HSI48RDY 48MHz HSI clock ready flag **/
#define RCC_CRRCR_HSI48RDY		(1 << 1)
/** RCC_CRRCR_HSI48ON 48MHz HSI clock enable bit **/
#define RCC_CRRCR_HSI48ON		(1 << 0)

/**@}*/

/** @defgroup rcc_cfgr CFGR Clock configuration register
@{*/


#define RCC_CFGR_MCOPRE_SHIFT		28
#define RCC_CFGR_MCOPRE_MASK		0x07
/** @defgroup rcc_cfgr_mcopre MCOPRE Microcontroller clock output prescaler
@{*/
/**@}*/


#define RCC_CFGR_MCOSEL_SHIFT		24
#define RCC_CFGR_MCOSEL_MASK		0x0f
/** @defgroup rcc_cfgr_mcosel MCOSEL Microcontroller clock output selection
@{*/
/**@}*/


#define RCC_CFGR_PLLDIV_SHIFT		22
#define RCC_CFGR_PLLDIV_MASK		0x03
/** @defgroup rcc_cfgr_plldiv PLLDIV PLL output division
@{*/
/**@}*/


#define RCC_CFGR_PLLMUL_SHIFT		18
#define RCC_CFGR_PLLMUL_MASK		0x0f
/** @defgroup rcc_cfgr_pllmul PLLMUL PLL multiplication factor
@{*/
/**@}*/

/** RCC_CFGR_PLLSRC PLL entry clock source **/
#define RCC_CFGR_PLLSRC		(1 << 16)
/** RCC_CFGR_STOPWUCK Wake-up from stop clock selection **/
#define RCC_CFGR_STOPWUCK		(1 << 15)

#define RCC_CFGR_PPRE2_SHIFT		11
#define RCC_CFGR_PPRE2_MASK		0x07
/** @defgroup rcc_cfgr_ppre2 PPRE2 APB high-speed prescaler (APB2)
@{*/
/**@}*/


