grevaillot/svd_tools/headers/STM32L0x2/rcc.h
#define RCC_CFGR_PPRE1_SHIFT		8
#define RCC_CFGR_PPRE1_MASK		0x07
/** @defgroup rcc_cfgr_ppre1 PPRE1 APB low-speed prescaler (APB1)
@{*/
/**@}*/


#define RCC_CFGR_HPRE_SHIFT		4
#define RCC_CFGR_HPRE_MASK		0x0f
/** @defgroup rcc_cfgr_hpre HPRE AHB prescaler
@{*/
/**@}*/


#define RCC_CFGR_SWS_SHIFT		2
#define RCC_CFGR_SWS_MASK		0x03
/** @defgroup rcc_cfgr_sws SWS System clock switch status
@{*/
/**@}*/


#define RCC_CFGR_SW_SHIFT		0
#define RCC_CFGR_SW_MASK		0x03
/** @defgroup rcc_cfgr_sw SW System clock switch
@{*/
/**@}*/


/**@}*/

/** @defgroup rcc_cier CIER Clock interrupt enable register
@{*/

/** RCC_CIER_CSSLSE LSE CSS interrupt flag **/
#define RCC_CIER_CSSLSE		(1 << 7)
/** RCC_CIER_HSI48RDYIE HSI48 ready interrupt flag **/
#define RCC_CIER_HSI48RDYIE		(1 << 6)
/** RCC_CIER_MSIRDYIE MSI ready interrupt flag **/
#define RCC_CIER_MSIRDYIE		(1 << 5)
/** RCC_CIER_PLLRDYIE PLL ready interrupt flag **/
#define RCC_CIER_PLLRDYIE		(1 << 4)
/** RCC_CIER_HSERDYIE HSE ready interrupt flag **/
#define RCC_CIER_HSERDYIE		(1 << 3)
/** RCC_CIER_HSI16RDYIE HSI16 ready interrupt flag **/
#define RCC_CIER_HSI16RDYIE		(1 << 2)
/** RCC_CIER_LSERDYIE LSE ready interrupt flag **/
#define RCC_CIER_LSERDYIE		(1 << 1)
/** RCC_CIER_LSIRDYIE LSI ready interrupt flag **/
#define RCC_CIER_LSIRDYIE		(1 << 0)

/**@}*/

/** @defgroup rcc_cifr CIFR Clock interrupt flag register
@{*/

/** RCC_CIFR_CSSHSEF Clock Security System Interrupt flag **/
#define RCC_CIFR_CSSHSEF		(1 << 8)
/** RCC_CIFR_CSSLSEF LSE Clock Security System Interrupt flag **/
#define RCC_CIFR_CSSLSEF		(1 << 7)
/** RCC_CIFR_HSI48RDYF HSI48 ready interrupt flag **/
#define RCC_CIFR_HSI48RDYF		(1 << 6)
/** RCC_CIFR_MSIRDYF MSI ready interrupt flag **/
#define RCC_CIFR_MSIRDYF		(1 << 5)
/** RCC_CIFR_PLLRDYF PLL ready interrupt flag **/
#define RCC_CIFR_PLLRDYF		(1 << 4)
/** RCC_CIFR_HSERDYF HSE ready interrupt flag **/
#define RCC_CIFR_HSERDYF		(1 << 3)
/** RCC_CIFR_HSI16RDYF HSI16 ready interrupt flag **/
#define RCC_CIFR_HSI16RDYF		(1 << 2)
/** RCC_CIFR_LSERDYF LSE ready interrupt flag **/
#define RCC_CIFR_LSERDYF		(1 << 1)
/** RCC_CIFR_LSIRDYF LSI ready interrupt flag **/
#define RCC_CIFR_LSIRDYF		(1 << 0)

/**@}*/

/** @defgroup rcc_cicr CICR Clock interrupt clear register
@{*/

/** RCC_CICR_CSSHSEC Clock Security System Interrupt clear **/
#define RCC_CICR_CSSHSEC		(1 << 8)
/** RCC_CICR_CSSLSEC LSE Clock Security System Interrupt clear **/
#define RCC_CICR_CSSLSEC		(1 << 7)
/** RCC_CICR_HSI48RDYC HSI48 ready Interrupt clear **/
#define RCC_CICR_HSI48RDYC		(1 << 6)
/** RCC_CICR_MSIRDYC MSI ready Interrupt clear **/
#define RCC_CICR_MSIRDYC		(1 << 5)
/** RCC_CICR_PLLRDYC PLL ready Interrupt clear **/
#define RCC_CICR_PLLRDYC		(1 << 4)
/** RCC_CICR_HSERDYC HSE ready Interrupt clear **/
#define RCC_CICR_HSERDYC		(1 << 3)
/** RCC_CICR_HSI16RDYC HSI16 ready Interrupt clear **/
#define RCC_CICR_HSI16RDYC		(1 << 2)
/** RCC_CICR_LSERDYC LSE ready Interrupt clear **/
#define RCC_CICR_LSERDYC		(1 << 1)
/** RCC_CICR_LSIRDYC LSI ready Interrupt clear **/
#define RCC_CICR_LSIRDYC		(1 << 0)

/**@}*/

/** @defgroup rcc_ioprstr IOPRSTR GPIO reset register
@{*/

/** RCC_IOPRSTR_IOPHRST I/O port H reset **/
#define RCC_IOPRSTR_IOPHRST		(1 << 7)
/** RCC_IOPRSTR_IOPERST I/O port E reset **/
#define RCC_IOPRSTR_IOPERST		(1 << 4)
/** RCC_IOPRSTR_IOPDRST I/O port D reset **/
#define RCC_IOPRSTR_IOPDRST		(1 << 3)
/** RCC_IOPRSTR_IOPCRST I/O port A reset **/
#define RCC_IOPRSTR_IOPCRST		(1 << 2)
/** RCC_IOPRSTR_IOPBRST I/O port B reset **/
#define RCC_IOPRSTR_IOPBRST		(1 << 1)
/** RCC_IOPRSTR_IOPARST I/O port A reset **/
#define RCC_IOPRSTR_IOPARST		(1 << 0)

/**@}*/

/** @defgroup rcc_ahbrstr AHBRSTR AHB peripheral reset register
@{*/

/** RCC_AHBRSTR_CRYPRST Crypto module reset **/
#define RCC_AHBRSTR_CRYPRST		(1 << 24)
/** RCC_AHBRSTR_RNGRST Random Number Generator module reset **/
#define RCC_AHBRSTR_RNGRST		(1 << 20)
/** RCC_AHBRSTR_TOUCHRST Touch Sensing reset **/
#define RCC_AHBRSTR_TOUCHRST		(1 << 16)
/** RCC_AHBRSTR_CRCRST Test integration module reset **/
#define RCC_AHBRSTR_CRCRST		(1 << 12)
/** RCC_AHBRSTR_MIFRST Memory interface reset **/
#define RCC_AHBRSTR_MIFRST		(1 << 8)
/** RCC_AHBRSTR_DMARST DMA reset **/
#define RCC_AHBRSTR_DMARST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2rstr APB2RSTR APB2 peripheral reset register
@{*/

/** RCC_APB2RSTR_DBGRST DBG reset **/
#define RCC_APB2RSTR_DBGRST		(1 << 22)
/** RCC_APB2RSTR_USART1RST USART1 reset **/
#define RCC_APB2RSTR_USART1RST		(1 << 14)
/** RCC_APB2RSTR_SPI1RST SPI 1 reset **/
#define RCC_APB2RSTR_SPI1RST		(1 << 12)
/** RCC_APB2RSTR_ADCRST ADC interface reset **/
#define RCC_APB2RSTR_ADCRST		(1 << 9)
/** RCC_APB2RSTR_TM12RST TIM22 timer reset **/
#define RCC_APB2RSTR_TM12RST		(1 << 5)
/** RCC_APB2RSTR_TIM21RST TIM21 timer reset **/
#define RCC_APB2RSTR_TIM21RST		(1 << 2)
/** RCC_APB2RSTR_SYSCFGRST System configuration controller reset **/
#define RCC_APB2RSTR_SYSCFGRST		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1rstr APB1RSTR APB1 peripheral reset register
@{*/

/** RCC_APB1RSTR_LPTIM1RST Low power timer reset **/
#define RCC_APB1RSTR_LPTIM1RST		(1 << 31)
/** RCC_APB1RSTR_I2C3RST I2C3 reset **/
#define RCC_APB1RSTR_I2C3RST		(1 << 30)
/** RCC_APB1RSTR_DACRST DAC interface reset **/
#define RCC_APB1RSTR_DACRST		(1 << 29)
/** RCC_APB1RSTR_PWRRST Power interface reset **/
#define RCC_APB1RSTR_PWRRST		(1 << 28)
/** RCC_APB1RSTR_CRSRST Clock recovery system reset **/
#define RCC_APB1RSTR_CRSRST		(1 << 27)
/** RCC_APB1RSTR_USBRST USB reset **/
#define RCC_APB1RSTR_USBRST		(1 << 23)
/** RCC_APB1RSTR_I2C2RST I2C2 reset **/
#define RCC_APB1RSTR_I2C2RST		(1 << 22)
/** RCC_APB1RSTR_I2C1RST I2C1 reset **/
#define RCC_APB1RSTR_I2C1RST		(1 << 21)
/** RCC_APB1RSTR_USART5RST USART5 reset **/
#define RCC_APB1RSTR_USART5RST		(1 << 20)
/** RCC_APB1RSTR_USART4RST USART4 reset **/
#define RCC_APB1RSTR_USART4RST		(1 << 19)
/** RCC_APB1RSTR_LPUART1RST LPUART1 reset **/
#define RCC_APB1RSTR_LPUART1RST		(1 << 18)
/** RCC_APB1RSTR_LPUART12RST UART2 reset **/
#define RCC_APB1RSTR_LPUART12RST		(1 << 17)
/** RCC_APB1RSTR_SPI2RST SPI2 reset **/
#define RCC_APB1RSTR_SPI2RST		(1 << 14)
/** RCC_APB1RSTR_WWDRST Window watchdog reset **/
#define RCC_APB1RSTR_WWDRST		(1 << 11)
/** RCC_APB1RSTR_TIM7RST Timer 7 reset **/
#define RCC_APB1RSTR_TIM7RST		(1 << 5)
/** RCC_APB1RSTR_TIM6RST Timer 6 reset **/
#define RCC_APB1RSTR_TIM6RST		(1 << 4)
/** RCC_APB1RSTR_TIM3RST Timer3 reset **/
#define RCC_APB1RSTR_TIM3RST		(1 << 1)
/** RCC_APB1RSTR_TIM2RST Timer2 reset **/
#define RCC_APB1RSTR_TIM2RST		(1 << 0)

/**@}*/

/** @defgroup rcc_iopenr IOPENR GPIO clock enable register
@{*/

/** RCC_IOPENR_IOPHEN I/O port H clock enable bit **/
#define RCC_IOPENR_IOPHEN		(1 << 7)
/** RCC_IOPENR_IOPEEN I/O port E clock enable bit **/
#define RCC_IOPENR_IOPEEN		(1 << 4)
/** RCC_IOPENR_IOPDEN I/O port D clock enable bit **/
#define RCC_IOPENR_IOPDEN		(1 << 3)
/** RCC_IOPENR_IOPCEN IO port A clock enable bit **/
#define RCC_IOPENR_IOPCEN		(1 << 2)
/** RCC_IOPENR_IOPBEN IO port B clock enable bit **/
#define RCC_IOPENR_IOPBEN		(1 << 1)
/** RCC_IOPENR_IOPAEN IO port A clock enable bit **/
#define RCC_IOPENR_IOPAEN		(1 << 0)

/**@}*/

