grevaillot/svd_tools/headers/STM32L0x2/rcc.h
/** @defgroup rcc_ahbenr AHBENR AHB peripheral clock enable register
@{*/

/** RCC_AHBENR_CRYPEN Crypto clock enable bit **/
#define RCC_AHBENR_CRYPEN		(1 << 24)
/** RCC_AHBENR_RNGEN Random Number Generator clock enable bit **/
#define RCC_AHBENR_RNGEN		(1 << 20)
/** RCC_AHBENR_TOUCHEN Touch Sensing clock enable bit **/
#define RCC_AHBENR_TOUCHEN		(1 << 16)
/** RCC_AHBENR_CRCEN CRC clock enable bit **/
#define RCC_AHBENR_CRCEN		(1 << 12)
/** RCC_AHBENR_MIFEN NVM interface clock enable bit **/
#define RCC_AHBENR_MIFEN		(1 << 8)
/** RCC_AHBENR_DMAEN DMA clock enable bit **/
#define RCC_AHBENR_DMAEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2enr APB2ENR APB2 peripheral clock enable register
@{*/

/** RCC_APB2ENR_DBGEN DBG clock enable bit **/
#define RCC_APB2ENR_DBGEN		(1 << 22)
/** RCC_APB2ENR_USART1EN USART1 clock enable bit **/
#define RCC_APB2ENR_USART1EN		(1 << 14)
/** RCC_APB2ENR_SPI1EN SPI1 clock enable bit **/
#define RCC_APB2ENR_SPI1EN		(1 << 12)
/** RCC_APB2ENR_ADCEN ADC clock enable bit **/
#define RCC_APB2ENR_ADCEN		(1 << 9)
/** RCC_APB2ENR_MIFIEN MiFaRe Firewall clock enable bit **/
#define RCC_APB2ENR_MIFIEN		(1 << 7)
/** RCC_APB2ENR_TIM22EN TIM22 timer clock enable bit **/
#define RCC_APB2ENR_TIM22EN		(1 << 5)
/** RCC_APB2ENR_TIM21EN TIM21 timer clock enable bit **/
#define RCC_APB2ENR_TIM21EN		(1 << 2)
/** RCC_APB2ENR_SYSCFGEN System configuration controller clock enable bit **/
#define RCC_APB2ENR_SYSCFGEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1enr APB1ENR APB1 peripheral clock enable register
@{*/

/** RCC_APB1ENR_LPTIM1EN Low power timer clock enable bit **/
#define RCC_APB1ENR_LPTIM1EN		(1 << 31)
/** RCC_APB1ENR_I2C3EN I2C3 clock enable bit **/
#define RCC_APB1ENR_I2C3EN		(1 << 30)
/** RCC_APB1ENR_DACEN DAC interface clock enable bit **/
#define RCC_APB1ENR_DACEN		(1 << 29)
/** RCC_APB1ENR_PWREN Power interface clock enable bit **/
#define RCC_APB1ENR_PWREN		(1 << 28)
/** RCC_APB1ENR_CRSEN Clock recovery system clock enable bit **/
#define RCC_APB1ENR_CRSEN		(1 << 27)
/** RCC_APB1ENR_USBEN USB clock enable bit **/
#define RCC_APB1ENR_USBEN		(1 << 23)
/** RCC_APB1ENR_I2C2EN I2C2 clock enable bit **/
#define RCC_APB1ENR_I2C2EN		(1 << 22)
/** RCC_APB1ENR_I2C1EN I2C1 clock enable bit **/
#define RCC_APB1ENR_I2C1EN		(1 << 21)
/** RCC_APB1ENR_USART5EN USART5 clock enable bit **/
#define RCC_APB1ENR_USART5EN		(1 << 20)
/** RCC_APB1ENR_USART4EN USART4 clock enable bit **/
#define RCC_APB1ENR_USART4EN		(1 << 19)
/** RCC_APB1ENR_LPUART1EN LPUART1 clock enable bit **/
#define RCC_APB1ENR_LPUART1EN		(1 << 18)
/** RCC_APB1ENR_USART2EN UART2 clock enable bit **/
#define RCC_APB1ENR_USART2EN		(1 << 17)
/** RCC_APB1ENR_SPI2EN SPI2 clock enable bit **/
#define RCC_APB1ENR_SPI2EN		(1 << 14)
/** RCC_APB1ENR_WWDGEN Window watchdog clock enable bit **/
#define RCC_APB1ENR_WWDGEN		(1 << 11)
/** RCC_APB1ENR_TIM7EN Timer 7 clock enable bit **/
#define RCC_APB1ENR_TIM7EN		(1 << 5)
/** RCC_APB1ENR_TIM6EN Timer 6 clock enable bit **/
#define RCC_APB1ENR_TIM6EN		(1 << 4)
/** RCC_APB1ENR_TIM3EN Timer3 clock enable bit **/
#define RCC_APB1ENR_TIM3EN		(1 << 1)
/** RCC_APB1ENR_TIM2EN Timer2 clock enable bit **/
#define RCC_APB1ENR_TIM2EN		(1 << 0)

/**@}*/

/** @defgroup rcc_iopsmen IOPSMEN GPIO clock enable in sleep mode register
@{*/

/** RCC_IOPSMEN_IOPHSMEN IOPHSMEN **/
#define RCC_IOPSMEN_IOPHSMEN		(1 << 7)
/** RCC_IOPSMEN_IOPESMEN Port E clock enable during Sleep mode bit **/
#define RCC_IOPSMEN_IOPESMEN		(1 << 4)
/** RCC_IOPSMEN_IOPDSMEN IOPDSMEN **/
#define RCC_IOPSMEN_IOPDSMEN		(1 << 3)
/** RCC_IOPSMEN_IOPCSMEN IOPCSMEN **/
#define RCC_IOPSMEN_IOPCSMEN		(1 << 2)
/** RCC_IOPSMEN_IOPBSMEN IOPBSMEN **/
#define RCC_IOPSMEN_IOPBSMEN		(1 << 1)
/** RCC_IOPSMEN_IOPASMEN IOPASMEN **/
#define RCC_IOPSMEN_IOPASMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_ahbsmenr AHBSMENR AHB peripheral clock enable in sleep mode register
@{*/

/** RCC_AHBSMENR_CRYPSMEN Crypto clock enable during sleep mode bit **/
#define RCC_AHBSMENR_CRYPSMEN		(1 << 24)
/** RCC_AHBSMENR_RNGSMEN Random Number Generator clock enable during sleep mode bit **/
#define RCC_AHBSMENR_RNGSMEN		(1 << 20)
/** RCC_AHBSMENR_TOUCHSMEN Touch Sensing clock enable during sleep mode bit **/
#define RCC_AHBSMENR_TOUCHSMEN		(1 << 16)
/** RCC_AHBSMENR_CRCSMEN CRC clock enable during sleep mode bit **/
#define RCC_AHBSMENR_CRCSMEN		(1 << 12)
/** RCC_AHBSMENR_SRAMSMEN SRAM interface clock enable during sleep mode bit **/
#define RCC_AHBSMENR_SRAMSMEN		(1 << 9)
/** RCC_AHBSMENR_MIFSMEN NVM interface clock enable during sleep mode bit **/
#define RCC_AHBSMENR_MIFSMEN		(1 << 8)
/** RCC_AHBSMENR_DMASMEN DMA clock enable during sleep mode bit **/
#define RCC_AHBSMENR_DMASMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb2smenr APB2SMENR APB2 peripheral clock enable in sleep mode register
@{*/

/** RCC_APB2SMENR_DBGSMEN DBG clock enable during sleep mode bit **/
#define RCC_APB2SMENR_DBGSMEN		(1 << 22)
/** RCC_APB2SMENR_USART1SMEN USART1 clock enable during sleep mode bit **/
#define RCC_APB2SMENR_USART1SMEN		(1 << 14)
/** RCC_APB2SMENR_SPI1SMEN SPI1 clock enable during sleep mode bit **/
#define RCC_APB2SMENR_SPI1SMEN		(1 << 12)
/** RCC_APB2SMENR_ADCSMEN ADC clock enable during sleep mode bit **/
#define RCC_APB2SMENR_ADCSMEN		(1 << 9)
/** RCC_APB2SMENR_TIM22SMEN TIM22 timer clock enable during sleep mode bit **/
#define RCC_APB2SMENR_TIM22SMEN		(1 << 5)
/** RCC_APB2SMENR_TIM21SMEN TIM21 timer clock enable during sleep mode bit **/
#define RCC_APB2SMENR_TIM21SMEN		(1 << 2)
/** RCC_APB2SMENR_SYSCFGSMEN System configuration controller clock enable during sleep mode bit **/
#define RCC_APB2SMENR_SYSCFGSMEN		(1 << 0)

/**@}*/

/** @defgroup rcc_apb1smenr APB1SMENR APB1 peripheral clock enable in sleep mode register
@{*/

/** RCC_APB1SMENR_LPTIM1SMEN Low power timer clock enable during sleep mode bit **/
#define RCC_APB1SMENR_LPTIM1SMEN		(1 << 31)
/** RCC_APB1SMENR_I2C3SMEN 2C3 clock enable during Sleep mode bit **/
#define RCC_APB1SMENR_I2C3SMEN		(1 << 30)
/** RCC_APB1SMENR_DACSMEN DAC interface clock enable during sleep mode bit **/
#define RCC_APB1SMENR_DACSMEN		(1 << 29)
/** RCC_APB1SMENR_PWRSMEN Power interface clock enable during sleep mode bit **/
#define RCC_APB1SMENR_PWRSMEN		(1 << 28)
/** RCC_APB1SMENR_CRSSMEN Clock recovery system clock enable during sleep mode bit **/
#define RCC_APB1SMENR_CRSSMEN		(1 << 27)
/** RCC_APB1SMENR_USBSMEN USB clock enable during sleep mode bit **/
#define RCC_APB1SMENR_USBSMEN		(1 << 23)
/** RCC_APB1SMENR_I2C2SMEN I2C2 clock enable during sleep mode bit **/
#define RCC_APB1SMENR_I2C2SMEN		(1 << 22)
/** RCC_APB1SMENR_I2C1SMEN I2C1 clock enable during sleep mode bit **/
#define RCC_APB1SMENR_I2C1SMEN		(1 << 21)
/** RCC_APB1SMENR_USART5SMEN USART5 clock enable during Sleep mode bit **/
#define RCC_APB1SMENR_USART5SMEN		(1 << 20)
/** RCC_APB1SMENR_USART4SMEN USART4 clock enable during Sleep mode bit **/
#define RCC_APB1SMENR_USART4SMEN		(1 << 19)
/** RCC_APB1SMENR_LPUART1SMEN LPUART1 clock enable during sleep mode bit **/
#define RCC_APB1SMENR_LPUART1SMEN		(1 << 18)
/** RCC_APB1SMENR_USART2SMEN UART2 clock enable during sleep mode bit **/
#define RCC_APB1SMENR_USART2SMEN		(1 << 17)
/** RCC_APB1SMENR_SPI2SMEN SPI2 clock enable during sleep mode bit **/
#define RCC_APB1SMENR_SPI2SMEN		(1 << 14)
/** RCC_APB1SMENR_WWDGSMEN Window watchdog clock enable during sleep mode bit **/
#define RCC_APB1SMENR_WWDGSMEN		(1 << 11)
/** RCC_APB1SMENR_TIM7SMEN Timer 7 clock enable during Sleep mode bit **/
#define RCC_APB1SMENR_TIM7SMEN		(1 << 5)
/** RCC_APB1SMENR_TIM6SMEN Timer 6 clock enable during sleep mode bit **/
#define RCC_APB1SMENR_TIM6SMEN		(1 << 4)
/** RCC_APB1SMENR_TIM3SMEN Timer3 clock enable during Sleep mode bit **/
#define RCC_APB1SMENR_TIM3SMEN		(1 << 1)
/** RCC_APB1SMENR_TIM2SMEN Timer2 clock enable during sleep mode bit **/
#define RCC_APB1SMENR_TIM2SMEN		(1 << 0)

/**@}*/

