grevaillot/svd_tools/headers/STM32L0x2/rcc.h
/** @defgroup rcc_ccipr CCIPR Clock configuration register
@{*/

/** RCC_CCIPR_HSI48MSEL 48 MHz HSI48 clock source selection bit **/
#define RCC_CCIPR_HSI48MSEL		(1 << 26)
/** RCC_CCIPR_LPTIM1SEL1 Low Power Timer clock source selection bits **/
#define RCC_CCIPR_LPTIM1SEL1		(1 << 19)
/** RCC_CCIPR_LPTIM1SEL0 LPTIM1SEL0 **/
#define RCC_CCIPR_LPTIM1SEL0		(1 << 18)

#define RCC_CCIPR_I2C3SEL_SHIFT		16
#define RCC_CCIPR_I2C3SEL_MASK		0x03
/** @defgroup rcc_ccipr_i2c3sel I2C3SEL I2C3 clock source selection bits
@{*/
/**@}*/

/** RCC_CCIPR_I2C1SEL1 I2C1 clock source selection bits **/
#define RCC_CCIPR_I2C1SEL1		(1 << 13)
/** RCC_CCIPR_I2C1SEL0 I2C1SEL0 **/
#define RCC_CCIPR_I2C1SEL0		(1 << 12)
/** RCC_CCIPR_LPUART1SEL1 LPUART1 clock source selection bits **/
#define RCC_CCIPR_LPUART1SEL1		(1 << 11)
/** RCC_CCIPR_LPUART1SEL0 LPUART1SEL0 **/
#define RCC_CCIPR_LPUART1SEL0		(1 << 10)
/** RCC_CCIPR_USART2SEL1 USART2 clock source selection bits **/
#define RCC_CCIPR_USART2SEL1		(1 << 3)
/** RCC_CCIPR_USART2SEL0 USART2SEL0 **/
#define RCC_CCIPR_USART2SEL0		(1 << 2)
/** RCC_CCIPR_USART1SEL1 USART1 clock source selection bits **/
#define RCC_CCIPR_USART1SEL1		(1 << 1)
/** RCC_CCIPR_USART1SEL0 USART1SEL0 **/
#define RCC_CCIPR_USART1SEL0		(1 << 0)

/**@}*/

/** @defgroup rcc_csr CSR Control and status register
@{*/

/** RCC_CSR_LPWRSTF Low-power reset flag **/
#define RCC_CSR_LPWRSTF		(1 << 31)
/** RCC_CSR_WWDGRSTF Window watchdog reset flag **/
#define RCC_CSR_WWDGRSTF		(1 << 30)
/** RCC_CSR_IWDGRSTF Independent watchdog reset flag **/
#define RCC_CSR_IWDGRSTF		(1 << 29)
/** RCC_CSR_SFTRSTF Software reset flag **/
#define RCC_CSR_SFTRSTF		(1 << 28)
/** RCC_CSR_PORRSTF POR/PDR reset flag **/
#define RCC_CSR_PORRSTF		(1 << 27)
/** RCC_CSR_PINRSTF PIN reset flag **/
#define RCC_CSR_PINRSTF		(1 << 26)
/** RCC_CSR_OBLRSTF OBLRSTF **/
#define RCC_CSR_OBLRSTF		(1 << 25)
/** RCC_CSR_RMVF Remove reset flag **/
#define RCC_CSR_RMVF		(1 << 24)
/** RCC_CSR_RTCRST RTC software reset bit **/
#define RCC_CSR_RTCRST		(1 << 19)
/** RCC_CSR_RTCEN RTC clock enable bit **/
#define RCC_CSR_RTCEN		(1 << 18)

#define RCC_CSR_RTCSEL_SHIFT		16
#define RCC_CSR_RTCSEL_MASK		0x03
/** @defgroup rcc_csr_rtcsel RTCSEL RTC and LCD clock source selection bits
@{*/
/**@}*/

/** RCC_CSR_CSSLSED CSS on LSE failure detection flag **/
#define RCC_CSR_CSSLSED		(1 << 14)
/** RCC_CSR_CSSLSEON CSSLSEON **/
#define RCC_CSR_CSSLSEON		(1 << 13)

#define RCC_CSR_LSEDRV_SHIFT		11
#define RCC_CSR_LSEDRV_MASK		0x03
/** @defgroup rcc_csr_lsedrv LSEDRV LSEDRV
@{*/
/**@}*/

/** RCC_CSR_LSEBYP External low-speed oscillator bypass bit **/
#define RCC_CSR_LSEBYP		(1 << 10)
/** RCC_CSR_LSERDY External low-speed oscillator ready bit **/
#define RCC_CSR_LSERDY		(1 << 9)
/** RCC_CSR_LSEON External low-speed oscillator enable bit **/
#define RCC_CSR_LSEON		(1 << 8)
/** RCC_CSR_LSIRDY Internal low-speed oscillator ready bit **/
#define RCC_CSR_LSIRDY		(1 << 1)
/** RCC_CSR_LSION Internal low-speed oscillator enable **/
#define RCC_CSR_LSION		(1 << 0)

/**@}*/
